In [1]:
import pandas as pd; import numpy as np

In [10]:
ser1 = pd.Series(data = np.arange(4), index=["a","c","d","e"])
ser2 = pd.Series(data = np.arange(5), index=["a","c","e","f","g"])

In [11]:
ser1

a    0
c    1
d    2
e    3
dtype: int32

In [12]:
ser2

a    0
c    1
e    2
f    3
g    4
dtype: int32

In [13]:
ser1 + ser2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [47]:
df1 = pd.DataFrame(data=np.arange(6).reshape(2, 3), 
                   columns=list("ABC"), 
                   index=["Tim", "Tom"])
df2 = pd.DataFrame(data=np.arange(9).reshape(3, 3), 
                   columns=list("ACD"), 
                   index=['Tim', "Kate", "Tom"])

In [48]:
df1

     A  B  C
Tim  0  1  2
Tom  3  4  5

In [49]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [50]:
df1 + df2

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [51]:
df1.add(df2)

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [53]:
df1

     A  B  C
Tim  0  1  2
Tom  3  4  5

In [54]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [57]:
df1.add(df2, fill_value=0)

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [58]:
df1.add(df2, fill_value=10)

         A     B     C     D
Kate  13.0   NaN  14.0  15.0
Tim    0.0  11.0   3.0  12.0
Tom    9.0  14.0  12.0  18.0

In [60]:
df1

     A  B  C
Tim  0  1  2
Tom  3  4  5

In [61]:
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

In [68]:
df1 + 3

     A  B  C
Tim  3  4  5
Tom  6  7  8

In [70]:
df1.add(3)

     A  B  C
Tim  3  4  5
Tom  6  7  8

In [71]:
df1-3

     A  B  C
Tim -3 -2 -1
Tom  0  1  2

In [72]:
df1.sub(3)

     A  B  C
Tim -3 -2 -1
Tom  0  1  2

In [63]:
df1*3

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [64]:
df1.mul(3)

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [66]:
df1/2

       A    B    C
Tim  0.0  0.5  1.0
Tom  1.5  2.0  2.5

In [67]:
df1.div(2)

       A    B    C
Tim  0.0  0.5  1.0
Tom  1.5  2.0  2.5

In [82]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [83]:
s = df2.iloc[[1]]
s

      A  C  D
Kate  3  4  5

In [84]:
df2-s

        A    C    D
Kate  0.0  0.0  0.0
Tim   NaN  NaN  NaN
Tom   NaN  NaN  NaN

In [88]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [89]:
s = df2.iloc[1]
s

A    3
C    4
D    5
Name: Kate, dtype: int32

In [91]:
df2-s

      A  C  D
Tim  -3 -3 -3
Kate  0  0  0
Tom   3  3  3

In [98]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [99]:
s2 = df2["A"]
s2

Tim     0
Kate    3
Tom     6
Name: A, dtype: int32

In [100]:
df2-s2

       A   C   D  Kate  Tim  Tom
Tim  NaN NaN NaN   NaN  NaN  NaN
Kate NaN NaN NaN   NaN  NaN  NaN
Tom  NaN NaN NaN   NaN  NaN  NaN

In [103]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [101]:
s2 = df2[["A"]]
s2

      A
Tim   0
Kate  3
Tom   6

In [102]:
df2-s2

      A   C   D
Tim   0 NaN NaN
Kate  0 NaN NaN
Tom   0 NaN NaN

In [120]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [121]:
s2 = df2["A"]
s2

Tim     0
Kate    3
Tom     6
Name: A, dtype: int32

In [124]:
df2.sub(s2, axis=0)

      A  C  D
Tim   0  1  2
Kate  0  1  2
Tom   0  1  2

In [125]:
df2.sub(s2, axis='index')

      A  C  D
Tim   0  1  2
Kate  0  1  2
Tom   0  1  2

In [3]:
import pandas as pd
import numpy as np

np.random.seed(1)
df=pd.DataFrame(
    np.random.randn(4,3),
    columns=list("ABC"),
    index=["Kim","Susan","Tim","Tom"])
df

              A         B         C
Kim    1.624345 -0.611756 -0.528172
Susan -1.072969  0.865408 -2.301539
Tim    1.744812 -0.761207  0.319039
Tom   -0.249370  1.462108 -2.060141

In [4]:
np.abs(df)

              A         B         C
Kim    1.624345  0.611756  0.528172
Susan  1.072969  0.865408  2.301539
Tim    1.744812  0.761207  0.319039
Tom    0.249370  1.462108  2.060141

In [5]:
df

              A         B         C
Kim    1.624345 -0.611756 -0.528172
Susan -1.072969  0.865408 -2.301539
Tim    1.744812 -0.761207  0.319039
Tom   -0.249370  1.462108 -2.060141

In [6]:
df.abs()

              A         B         C
Kim    1.624345  0.611756  0.528172
Susan  1.072969  0.865408  2.301539
Tim    1.744812  0.761207  0.319039
Tom    0.249370  1.462108  2.060141

In [7]:
df

              A         B         C
Kim    1.624345 -0.611756 -0.528172
Susan -1.072969  0.865408 -2.301539
Tim    1.744812 -0.761207  0.319039
Tom   -0.249370  1.462108 -2.060141

In [11]:
df.apply(lambda x: x.max())

A    1.744812
B    1.462108
C    0.319039
dtype: float64

In [26]:
df_ = df.apply([lambda x: x.max()])
df_.index = ['max']

df_

            A         B         C
max  1.744812  1.462108  0.319039

In [33]:
df.apply(lambda x: x.max(), axis=0)

A    1.744812
B    1.462108
C    0.319039
dtype: float64

In [46]:
df.apply(lambda x: x.max(), axis=1)

Kim      1.624345
Susan    0.865408
Tim      1.744812
Tom      1.462108
dtype: float64

In [51]:
df_ = df.apply([lambda x: x.max()], axis=1)
df_.columns = ['max']

df_

            max
Kim    1.624345
Susan  0.865408
Tim    1.744812
Tom    1.462108

In [1]:
import pandas as pd

games = pd.read_csv(r'C:\Users\dell\Desktop\img\vgsalesGlobale.csv')

games

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Syrup - Monin - Passion Fruit,Nintendo Switch,2008,Action,Devshare,82.51,20.44,8.39,10.16,7.01
1,2,Yams,Nintendo Switch,2010,Sports,Muxo,7.43,8.40,9.66,3.07,6.33
2,3,"Pepsi, 355 Ml",PS4,1985,Sports,Eidel,17.50,17.96,7.15,4.74,5.63
3,4,Gherkin,Xbox One,2016,Action,Mynte,13.05,5.60,5.64,6.97,1.23
4,5,Pastry - French Mini Assorted,Nintendo Switch,2020,Shooter,Quinu,16.92,24.00,5.59,5.16,3.66
...,...,...,...,...,...,...,...,...,...,...,...
995,996,Shrimp - Black Tiger 16/20,Xbox One,1985,Sports,Edgewire,77.09,3.36,0.69,10.33,0.34
996,997,Muffin Mix - Morning Glory,Xbox One,2011,Shooter,Skyba,5.14,8.72,4.02,7.42,8.20
997,998,Muffin Orange Individual,PS4,1996,Action,Topicstorm,19.89,27.42,4.02,4.12,0.65
998,999,Sage - Ground,PS4,1997,Sports,Jabbertype,38.59,7.22,6.20,3.71,0.09
999,1000,Cheese - Swiss Sliced,Xbox One,1996,Action,Voonyx,58.61,21.83,5.89,2.65,0.50

In [97]:
games.apply([lambda x: x.max()])

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
<lambda>,1000,"Zucchini - Mini, Green",Xbox One,2022,Sports,Zoozzy,82.73,29.0,10.22,10.55,10.56

In [138]:
games.apply([lambda x: x.max()])[["NA_Sales"]]

          NA_Sales
<lambda>     82.73

In [140]:
games.apply([lambda x: x.max()], axis=0)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
<lambda>,1000,"Zucchini - Mini, Green",Xbox One,2022,Sports,Zoozzy,82.73,29.0,10.22,10.55,10.56

In [145]:
games[["Year", "NA_Sales"]].apply([lambda x: x.min()])

          Year  NA_Sales
<lambda>  1980      0.14

In [161]:
def min_(x):
    return x.min()
    
games[["Year", "NA_Sales"]].apply([min_])

      Year  NA_Sales
min_  1980      0.14

In [11]:
def max_(x):
    return x.max()

games[["NA_Sales"]].apply([max_])

      NA_Sales
max_     82.73

In [77]:
def max_(x):
    return x.max()

games.apply([max_], axis=0)[["NA_Sales"]]

      NA_Sales
max_     82.73

In [78]:
games

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Syrup - Monin - Passion Fruit,Nintendo Switch,2008,Action,Devshare,82.51,20.44,8.39,10.16,7.01
1,2,Yams,Nintendo Switch,2010,Sports,Muxo,7.43,8.40,9.66,3.07,6.33
2,3,"Pepsi, 355 Ml",PS4,1985,Sports,Eidel,17.50,17.96,7.15,4.74,5.63
3,4,Gherkin,Xbox One,2016,Action,Mynte,13.05,5.60,5.64,6.97,1.23
4,5,Pastry - French Mini Assorted,Nintendo Switch,2020,Shooter,Quinu,16.92,24.00,5.59,5.16,3.66
...,...,...,...,...,...,...,...,...,...,...,...
995,996,Shrimp - Black Tiger 16/20,Xbox One,1985,Sports,Edgewire,77.09,3.36,0.69,10.33,0.34
996,997,Muffin Mix - Morning Glory,Xbox One,2011,Shooter,Skyba,5.14,8.72,4.02,7.42,8.20
997,998,Muffin Orange Individual,PS4,1996,Action,Topicstorm,19.89,27.42,4.02,4.12,0.65
998,999,Sage - Ground,PS4,1997,Sports,Jabbertype,38.59,7.22,6.20,3.71,0.09
999,1000,Cheese - Swiss Sliced,Xbox One,1996,Action,Voonyx,58.61,21.83,5.89,2.65,0.50

In [138]:
def max_min(x):
    return x.max() - x.min()

games[["NA_Sales"]].apply([max_min], axis=0)

         NA_Sales
max_min     82.59

In [139]:
def increase(x):
    return x.EU_Sales*2
    
games.apply([increase], axis=1)

     increase
0       40.88
1       16.80
2       35.92
3       11.20
4       48.00
..        ...
995      6.72
996     17.44
997     54.84
998     14.44
999     43.66

[1000 rows x 1 columns]